## Задачи по Numpy

In [1]:
import numpy as np

a = np.array([[1, 6],
              [2, 8],
              [3, 11],
              [3, 10],
              [1, 7]])
mean_a = np.mean(a, axis = 0)
print(mean_a)

[2.  8.4]

In [2]:
a_centered = a - mean_a
print(a_centered)

[[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]

In [10]:
a_centered_sp = 0
for i in range(a_centered.shape[0]):
    a_centered_sp = a_centered_sp + a_centered[i, 0] * a_centered[i, 1]
print(a_centered_sp)
covar = a_centered_sp / (a_centered.shape[0] - 1)
print(covar)

8.0
2.0

In [15]:
a_t = np.transpose(a)
covar1 = np.cov(a_t)[0,1] #Применяем функцию np.cov, выделяем искомый элемент из полученной матрицы.  
#print(covar1)
if covar == covar1:
    print('Значения ковариации совпадают')
else:
    print('Значения ковариации не совпадают')
# Задание простое, я его сделал, но смысл этой операции остался загадкой :(

Значения ковариации совпадают

## Задачи по Pandas

In [16]:
import pandas as pd

authors = pd.DataFrame({'author_id': [1, 2, 3],
                        'author_name': ['Тургенев', 'Чехов', 'Островский']})
book = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3],
                     'book': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                     'price': [450, 300, 350, 500, 450, 370, 290]})

In [18]:
authors_price = pd.merge(authors, book, on='author_id', how='outer')
authors_price
# получаем исходный датафрейм

   author_id author_name                  book  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [27]:
authors_price.nlargest(5, "price")

   author_id author_name               book  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

In [19]:
# Задача:
#Создайте датафрейм authors_stat на основе информации из authors_price.
#В датафрейме authors_stat должны быть четыре столбца:
#author_name, min_price, max_price и mean_price,
#в которых должны содержаться соответственно имя автора,
#минимальная, максимальная и средняя цена на книги этого автора.

authors_stat = authors_price.groupby('author_name')['price'].agg(['min', 'max', 'mean'])
authors_stat

             min  max        mean
author_name
Островский   290  370  330.000000
Тургенев     300  450  366.666667
Чехов        450  500  475.000000

In [23]:
#Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться данные о том, 
#какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные из следующего списка:
#['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].

authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price

   author_id author_name                  book  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [36]:
#Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. 
#Используйте для этого функцию pd.pivot_table. При этом столбцы должны называться "твердая" и "мягкая", 
#а индексами должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями. 

pivot_authors_cover = pd.pivot_table(authors_price, 'price', index='author_name', columns='cover').fillna(0)
pivot_authors_cover

cover        мягкая  твердая
author_name
Островский    330.0      0.0
Тургенев      325.0    450.0
Чехов           0.0    475.0